#include<stdio.h>
/*	
	p39 返回 x中 从第p位开始的n位 :-------最右边为0位。 
	return x &  ~( ~(~0 <<n)   <<(p + 1 - n)  )  ;-|eg：p=7，n=4制作完整屏蔽码 
	1.---------------~0----------------------------|1111111111--->无屏蔽值的屏蔽码
	2.--------------(~0 <<n)-----------------------|1111110000--->  
	3.-------------~(~0 <<n)-----------------------|0000001111---> 
	4.--------------(~0 <<n)   <<(p + 1 - n)-------|0001111000--->留n屏蔽码 
	5.-------------~(~0 <<n)   <<(p + 1 - n)-------|1110000111--->x清n屏蔽码
		
	1.将x对应位置清空
		x AND 屏蔽码清n位 ：x & ~( ~(~0 <<n)   <<(p + 1 - n) 
	2.将y留n位并移位， 
	    方法1；y AND 屏蔽码，再移位：(y & ~(~0 <<n))  <<(p + 1 - n) 
		方法2：y 移位       再 AND 拎一个屏蔽码 ； ( y <<(p + 1 - n) ) & ( ~(~0 <<n) <<(p + 1 - n) 
	3. 
	3.x,y &按位相与。
	
 (~(~0 <<n)) << p	 
*/
/* setbits: set n  bits of x    position p with       bits of y */
main(){
} 
unsigned setbits(unsigned x, int p, int n, unsigned y) {
	return x & ~( ~(~0 <<n)   <<(p + 1 - n)  )  |
	         (y & ~(~0 <<n))  <<(p + 1 - n) ;
}


